document.addEventListener('DOMContentLoaded', () => {
    const searchInput = document.getElementById('searchInput');

    if (searchInput) {
        searchInput.addEventListener('input', (e) => {
            if (e.target.value.toLowerCase() === 'gaster') {
                triggerGasterEasterEggOmg();
            }
        });
    }
});

// ⬧︎︎♋︎︎♓︎︎ ♎︎︎♋︎︎❑︎︎◆︎︎♓︎︎📪︎︎ ♓︎︎⬧︎︎⬧︎︎□︎︎ ♏︎♒︎ ⬧︎︎♏︎︎♍︎︎❒︎︎♏︎︎⧫︎︎□︎︎✏︎︎✏︎︎✏︎︎

function triggerGasterEasterEggOmg() {

    const audio = new Audio('../pasta/gaster_secret_easteregg.mp3');
    audio.play();

    const overlay = document.createElement('div');
    overlay.style.position = 'fixed';
    overlay.style.top = '0';
    overlay.style.left = '0';
    overlay.style.width = '100vw';
    overlay.style.height = '100vh';
    overlay.style.backgroundColor = 'black';
    overlay.style.zIndex = '9999';
    overlay.style.display = 'flex';
    overlay.style.justifyContent = 'center';
    overlay.style.alignItems = 'center';
    overlay.style.pointerEvents = 'none';

    const img = document.createElement('img');
    img.src = '../pasta/wingding_gaster_secret.jpg';
    img.style.maxWidth = '100%';
    img.style.maxHeight = '100%';
    img.style.objectFit = 'contain';

    overlay.appendChild(img);
    document.body.appendChild(overlay);

    setTimeout(() => {
        try {
            window.close();
        } catch (e) { }
        document.body.innerHTML = '';
        document.body.style.backgroundColor = 'black';
    }, 3000);
}

// ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣤⣤⣤⣤⣤⣤⣤⠀⠀⠀⠀⠀⠀⠀⠀
// ⠀⠀⠀⠀⠀⠀⠀⢠⢰⣾⠉⠉⠉⠉⠉⠉⠉⠉⣶⣶⣶⢀⠀⠀⠀⠀
// ⠀⠀⠀⠀⢀⠠⣤⡿⢿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠿⣤⡄⠀⠀
// ⠀⠀⠀⠀⢀⢠⣿⡇⢸⣿⠀⠀⠀⠀⠀⠀⢀⠠⢀⡀⠀⠀⣿⡇⠀⠀
// ⠀⠀⠀⠀⢸⣿⠀⣤⡼⠿⠀⠀⠀⠀⠀⣤⣼⣿⣿⣧⣄⠀⠿⣧⣤⠀
// ⠀⠀⠀⣶⣾⠉⠀⣿⣏⢀⠀⠀⢰⣶⠀⣿⣿⣿⣿⣿⣿⣶⠀⣽⣿⠀
// ⠀⠀⠀⣿⣿⠀⠀⠿⢿⣿⠀⣠⣼⣿⠀⣾⣿⣿⣿⣿⣿⣿⠀⢾⣿⠀
// ⠀⠀⠀⣿⣿⠀⣶⡆⢸⣿⣶⣿⣿⣿⠀⣽⣿⣿⣿⣿⣿⣿⠀⣻⣿⠀
// ⠀⠀⠀⣿⣿⠀⠿⣿⣿⣿⣿⣿⡿⠿⠀⠀⠸⠿⣿⡿⠟⠀⠀⢿⣿⠀
// ⠀⠀⠀⣿⡿⠀⠀⠛⢻⣿⣿⡟⠃⠀⠀⠀⠀⠠⣿⡇⠀⠀⠀⣿⣿⠀
// ⠀⠀⠀⠀⢸⣿⠀⠀⢠⣤⠀⠀⠀⠀⠀⠀⠀⠐⣿⣧⣄⠀⠀⢿⣿⠀
// ⠀⠀⠀⠀⢸⣿⠀⠀⢸⣿⣶⡆⠀⠀⠀⠀⠀⢈⣿⣿⣿⠀⣶⡟⠋⠀
// ⠀⠀⠀⠀⠈⠠⣿⠇⠀⠈⠿⣿⣇⣀⣀⣿⣿⣿⠿⠇⢀⣀⠿⠇⠀⠀
// ⠀⠀⠀⠀⠀⠀⠛⣷⣆⠀⠀⠙⢻⣿⣿⣿⣿⣿⠀⠀⢸⣿⠀⠀⠀⠀
// ⠀⠀⠀⠀⢀⣈⣿⣿⣧⣀⠀⠀⠈⠈⠿⠿⠷⠁⣀⣿⣿⣀⠀⠀⠀⠀
// ⠀⠀⠀⠄⢸⣿⣿⣿⣿⣿⣶⣶⣶⣶⣶⣶⣴⣶⣿⣿⣿⣿⠀⠀⠀⠀
// ⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠠⣿⣿⣿⣿⣿⡇⠀⠀
// ⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠂⠐⠀⠀⠠⣿⣿⣿⣿⣿⣧⣄⠀
// ⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠐⣿⣿⣿⣿⣿⣿⣿⠀
// ⠀⢀⣤⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⢠⣬⣿⣿⣿⣿⣿⣿⣿⠀
// ⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡆⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⠀
// ⠀⢘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⠀
// ⠀⠸⣿⣿⣿⣿⠛⠛⢻⣿⣿⣿⣷⣶⠀⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣶
// ⢸⣿⣿⡿⠿⠑⠿⠿⠿⠈⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⣿⣿⣿⣿
// ⢸⣿⣿⡇⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⠛⠃⢰⣶⠛⣻⣿⣿
// ⢸⣿⣿⣃⡀⠀⠀⠀⢀⣐⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠸⠿⠀⣽⣿⣿
// ⢸⣿⣿⣿⣿⣤⣧⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣴⡆⠀⠀⣶⣾⣿⣿
// ⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
// ⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
// ⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
// ⠘⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠛
// ⠀⠀⠉⠿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠀
// ⠀⠀⠀⠀⠘⠛⠛⠛⠛⠛⠛⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠛⠛⠃⠀⠀
